"""У якості дз надіслати посилання на гітхаб

1. Створіть функцію, яка підраховує кількість 
цифр у числі

2. Користувач вводить рядок, необхідно отримати 
кількість повторень кожного слова в рядку. 
Ігноруємо коми, крапки. Вивід: слово: кількість і т.д.

3. Створити список із цілих чисел. Його необхідно 
відфільтрувати, щоб у результаті залишилися парні числа. 
Вивести квадрати цих чисел, використовуючи map().

4. Створіть словник, у якому кожна пара — це студент і 
список його оцінок
* Вивести по кожному студенту середній бал
* Вивести студента з максимальною оцінкою

5. Напишіть функцію, яка приймає рядок і повертає словник, 
де ключ — це символ рядка, а значення — кількість його повторень.

6. Створіть кортеж із кількох рядків і чисел. 
Напишіть функцію, яка повертає новий кортеж, 
що містить лише числа.

7. Напишіть функцію, яка приймає список рядків і 
повертає список, у якому рядки відсортовані за довжиною.

8. Створіть словник із даними про співробітників 
компанії (ім’я, посада, зарплата). Напишіть функцію, 
яка сортує співробітників за зарплатою.

9. Використовуючи лямбда-вираз, створіть функцію, 
яка повертає найбільше з двох чисел.

10. Напишіть функцію, яка знаходить усі унікальні 
елементи в списку і повертає їх у вигляді множини.

11. Створіть словник, де ключі — це числа від 1 до 10,
 а значення — їхні квадрати. Напишіть функцію, яка 
 знаходить суму всіх значень у словнику.

12. Напишіть функцію, яка приймає список чисел і повертає 
новий список, що містить лише ті числа, які більші за 10 і парні.

13. Створіть кортеж із кількох чисел. Напишіть функцію, 
яка знаходить суму всіх чисел у кортежі.

14. Напишіть лямбда-функцію, яка перевіряє, чи є число додатним.

15. Створіть словник, у якому зберігаються імена людей і 
їхній вік. Напишіть функцію, яка приймає вік і повертає 
список імен людей, старших за цей вік.

16. Створіть кортеж із чисел і напишіть функцію, яка 
знаходить найбільше і найменше значення в кортежі.

17. Використовуючи лямбда-вираз і функцію filter, 
знайдіть усі числа, які діляться на 3, у списку чисел.

18. Напишіть функцію, яка перетворює рядок у список 
кортежів, де кожен кортеж містить символ і його індекс у рядку.

19. Напишіть генератор, який буде генерувати числа, 
що діляться на 3 або 5, починаючи з 1 і до заданої межі.

20. Напишіть замикання, яке дозволяє викликати передану 
функцію не більше ніж **n** разів. Після перевищення
ліміту має повертатися помилка або повідомлення.

21. Створіть замикання, яке приймає список чисел і 
повертає функцію, що перевіряє, чи належить число цьому списку.

22. Напишіть замикання, яке приймає шаблон рядка і 
повертає функцію, що форматує рядок за цим шаблоном.

"""