d1 = {"key1":"value1"}
d2 = dict()

for item in d1.items():
    print(item[1])
# звертатися до елменту словника можна використовуючи ключі

print(d1["key1"]) # Output: value1

# якщо спробувати надати нове значення для ключа якого не існує в словнику, створюється новий елемент
d1["key2"]="Hello" # key2 не існує в d1, помилки не буде, створиться нова пара
print(d1) # Output: {"key1:"value1", "key2":"Hello"}

# len() - повертає кількість елментів будь-якої послідовності
length=len(d1)
print("Length of d1:", length)

# методи словнику

# copy() – створює поверхневу копію словника
newDict = d1.copy()
print(newDict)

# get(key, default) – повертає значення за ключем
print(d1.get("key1")) # якщо ключ не знайдено, повертається None або дефолтне значення яке передається другим параметром

# items() – повертає всі пари(ключ, значення) у вигляді списку кортежів
for key, value in d1.items():
    print("Key:", key,"Value:", value)
    
# keys() – повертає список ключів
for key in d1.keys():
    print(key)
    
# якщо до циклу передати просто d1 то все одно будуть повертатися ключі
for key in d1:
    print(key)
    
# pop(key, default) – повертає елемент за ключем та видаляє
print(d1.pop("key1"))

# якщо передати неіснуючий ключ, тоді спрацює помилка, але якщо передати дефолтне значення
# другим параметром, помилки не буде, повернеться дефолтне значення
print(d1.pop("key3","not_found"))

# popitem() – повертає останню пару, та видаляє зі словнику
print(d1.popitem())
print(d1)

# update(other_dict) – об’єднання двух словників
d1.update({"key3":"value3","key4":"value4","key5":"value5"})
print(d1)

# values() – повертає список значень
print(d1.values())

# Ще один спосіб видалення пари зі словнику
del d1["key3"] # якщо ключа не існує спрацює помилка KeyError
print(d1)

# clear() – очищує словник
d1.clear()
print(d1)

